{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1669838496265", "link": "https://www.agtechsowhat.com/"}, "title": "Why is autonomy in ag so hard? With Ray Russell and Connie Bowen", "subtitle": "Why is autonomy in ag so hard? With Ray Russell and Connie Bowen", "summary": "<p>We’ve talked and thought a lot about autonomy this year, and despite what we think are some promising developments, overall, we continue to be struck by just how hard it is to bring solutions to market. From the technology to the use case, from the regulations to data, there are barriers and problems to solve in every direction.</p><p>So today we’re covering a ton of ground to understand why bringing autonomous solutions to agriculture is so hard. First, we talk to Connie Bowen of Farmhand Ventures, who is not particularly bullish on the near term viability of full autonomy, and has instead chosen to focus on what she calls “collaborative robotics”. Then we check in with Ray Russell, Principal Hardware Engineer at Locomation on specifically why technical problems stand in the way of progress in the autonomous space. Finally, we check in briefly with Kevin Andrews, Strat Marketing Manager for Autonomy at Trimble Agriculture to understand how more established equipment players are thinking about tackling autonomy’s biggest challenges. </p><p>For more information and resources, visit our <a href=\"https://feeds.backtracks.fm/feeds/tenacious/agtech-so-what/websitetenacious.ventures/notes/why-is-autonomy-in-ag-so-hard-with-ray-russell-and-connie-bowen\">website</a>.</p><p>The information in this post is not investment advice or a recommendation to invest. It is general information only and does not take into account your investment objectives, financial situation or needs. Before making an investment decision you should read the information memorandum and seek financial advice from a professional financial adviser. Whilst we believe Information is correct, no warranty of accuracy, reliability or completeness is given, except for liability under statue which cannot be excluded.<br /></p>", "publicationDate": "Wed, 30 Nov 2022 20:00:00 +0000", "duration": "00:37:07", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/d157c4be-6f54-11ed-9f1a-124826532ffb/images/main.png?1669838496447", "link": "https://tenacious.ventures/notes/why-is-autonomy-in-ag-so-hard-with-ray-russell-and-connie-bowen", "audio": [{"url": "https://backtracks.fm/tenacious/pr/d1530438-6f54-11ed-9f1a-124826532ffb/ep156_trimble_autonomous_1.mp3?s=1&sd=1&u=1669664701", "size": "53513216", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}